In [1]:
from os import listdir
import re
import chardet
import pandas as pd
import datetime
from city import City
import mysql.connector
from mysql.connector.cursor import MySQLCursorPrepared

In [2]:
df = pd.read_csv("cities15000.csv", sep="\t", header=None)
df[df[5] > 100].head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18
395,2058430,Whyalla,Whyalla,"Gorad Uajala,Gouaialla,Uajalla,Vajala,Vajalla,...",-33.03268,137.56483,P,PPLA2,AU,NaN,05,48540,NaN,NaN,19645,NaN,20,Australia/Adelaide,2013-08-23
396,2062338,Rockingham,Rockingham,"Rockingham,Rokingam,Rokingem,Рокингам,Рокінгем...",-32.27682,115.72978,P,PPLA2,AU,NaN,08,57490,NaN,NaN,108022,NaN,8,Australia/Perth,2017-04-20
397,2062944,Prospect,Prospect,NaN,-34.88241,138.59330,P,PPL,AU,NaN,05,46510,NaN,NaN,20217,NaN,43,Australia/Adelaide,2013-06-25
398,2063042,Port Hedland,Port Hedland,"PHE,Port Hedland,Port Khedland,Port-Gedlend,Po...",-20.31215,118.61059,P,PPL,AU,NaN,08,57280,NaN,NaN,15044,NaN,5,Australia/Perth,2013-06-25
399,2063523,Perth,Perth,"Gorad Pert,PER,Peairt,Pert,Perta,Pertas,Perth,...",-31.95224,115.86140,P,PPLA,AU,NaN,08,57080,NaN,NaN,1896548,NaN,34,Australia/Perth,2015-06-29

In [3]:
df.rename(columns={1:'AccentCity'}, inplace=True)
df.rename(columns={4:'Latitude'}, inplace=True)
df.rename(columns={5:'Longitude'}, inplace=True)
df.head(1)

,0,AccentCity,2,3,Latitude,Longitude,6,7,8,9,10,11,12,13,14,15,16,17,18
0,3040051,les Escaldes,les Escaldes,"Ehskal'des-Ehndzhordani,Escaldes,Escaldes-Engo...",42.50729,1.53414,P,PPLA,AD,NaN,08,NaN,NaN,NaN,15853,NaN,1033,Europe/Andorra,2008-10-15

In [4]:
con = mysql.connector.connect(
    host="139.59.140.52",
    #host="localhost",
    user="dbexamuser",
    database="examdb",
    passwd="dbExam.group7",
    use_pure=True,
)
print("con created")
con.autocommit = False
mycursor = con.cursor(cursor_class=MySQLCursorPrepared)
print(con)

con created
<mysql.connector.connection.MySQLConnection object at 0x7fcde738db00>

In [5]:
def insert_cities():
    now = datetime.datetime.now()
    large_sql = ""
    counter = 1
    interval_counter = 0
    interval = 1000
    
    for i, row in df.iterrows():
        city_name = row["AccentCity"]
        city_long = row["Longitude"]
        city_lat = row["Latitude"]
        sql = """
            INSERT INTO examdb.cities 
            (name, latitude, longtitude) 
            VALUES (%s, %s , %s);
            """
        
        insert_values = (city_name, city_lat, city_long)
        
        mycursor.execute(sql, insert_values)
        #print(mycursor.statement)
        #print(sql % insert_values)
        
        if (counter >= interval_counter + interval):
            con.commit()
            interval_counter += interval
            print(counter)
            
        counter += 1
        
    #print(large_sql)
    #mycursor.execute(large_sql, multi = True)
    con.commit()
    
    time_diff = datetime.datetime.now() - now
    print(time_diff.total_seconds())

insert_cities()

1000
2000
3000
4000
5000
6000
7000
8000
9000
10000
11000
12000
13000
14000
15000
16000
17000
18000
19000
20000
21000
22000
23000
24000
9.163342

In [6]:
print("done")

done

In [7]:
con.close()
mycursor.close()